# оголошуємо функцію
def get_cats_info(path):
    # Створюємо порожній список для зберегання результату
    cats = []
    # Створюємо блок для обробки можливих помилок
    try:
      # Відкриваємо файл з кодуванням utf-8  
        with open(path, encoding="utf-8") as file:
            # Ситуємо інформацію с кожного рядка файлу
            for line in file:
                # очищуємо інформацію в рядках, то різділяємо її комою 
                parts = line.strip().split(',')
                # перевіряємо чи отримано три параметрм з кожного рядка
                if len(parts) == 3:
                    # Розпаковуємо значення у відповідні змінні
                    cat_id, name, age = parts
                    # Додавання інформації про котів у вигляді словника
                    cats.append({
                        "id": cat_id,
                        "name": name,
                        "age": age
                    })
    # Обробка помилка, якщо файл не знайдено
    except FileNotFoundError:
        print(f"Файл {path} не знайдено.")
    # Повертаємо результат у вишляді списку з інформацією про всіх котів
    return cats
# Викликаємо функції для отримання даних з файлу
cats_info = get_cats_info("cats_file.txt")
# Виводимо інформацію про кожного кота з нового рядка 
for cat in cats_info:
    print(f"ID: {cat['id']}, Name: {cat['name']}, Age: {cat['age']}")